Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиВыводаДополнительныхПолей</name>
    <attributes>
      <name>РеквизитДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНаУстройстве</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Enums/SUI_ТипыИдентификацииСтрокТЧ/SUI_ТипыИдентификацииСтрокТЧ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыИдентификацииСтрокТЧ</name>
  <enumValues>
    <name>ПоРеквизиту</name>
  </enumValues>
  <enumValues>
    <name>ПоСовокупностиРеквизитов</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/Forms/ФормаНастройкиИдентификацииСтрокТЧ/Module.bsl
#Область ОписаниеПеременных

&НаСервере
Перем МетаданныеТЧ, ПараметрыИдентификацииТЧ;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеДокумента = Метаданные.Документы.Найти(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Параметры, "ИмяОбъектаМетаданных", "", Тип("Строка")));
		
	Если МетаданныеДокумента <> Неопределено Тогда
		
		НаименованиеДокумента = МетаданныеДокумента.Синоним;
		
		МетаданныеТЧ = МетаданныеДокумента.ТабличныеЧасти.Найти(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			Параметры, "ИмяТабличнойЧасти", "", Тип("Строка")));
			
	КонецЕсли;
	
	ПараметрыИдентификацииТЧ = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			Параметры, "ПараметрыИдентификацииСтрокТЧ", Новый Структура(), Тип("Структура"));
	
	ИнициализироватьФормуПриСоздании(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СменитьСтраницуНастройкиРеквизитовИдентификацииСтрок();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	Если ТипИдентификацииСтроки = Перечисления.SUI_ТипыИдентификацииСтрокТЧ.ПоРеквизиту Тогда
		ПроверяемыеРеквизиты.Добавить("РеквизитИдентификацииСтроки");
	ИначеЕсли ТипИдентификацииСтроки = Перечисления.SUI_ТипыИдентификацииСтрокТЧ.ПоСовокупностиРеквизитов Тогда
		ПроверяемыеРеквизиты.Добавить("ВыбранныеРеквизитыИдентификацииСтроки");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипИдентификацииСтрокиПриИзменении(Элемент)
	СменитьСтраницуНастройкиРеквизитовИдентификацииСтрок();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыбранныеРеквизитыИдентификацииСтроки

&НаКлиенте
Процедура ВыбранныеРеквизитыИдентификацииСтрокиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыИдентификацииСтрокиВыбор(Элемент.ТекущиеДанные.Значение, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоступныеРеквизитыИдентификацииСтрок

&НаКлиенте
Процедура ДоступныеРеквизитыИдентификацииСтрокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыИдентификацииСтрокиВыбор(Элемент.ТекущиеДанные.Значение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВВыбранныеРеквизитыИдентификацииСтроки(Команда)
	
	Если Команда.ИспользуемаяТаблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыИдентификацииСтрокиВыбор(Команда.ИспользуемаяТаблица.ТекущиеДанные.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзВыбранныхРеквизитовИдентификацииСтроки(Команда)
	
	Если Команда.ИспользуемаяТаблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыИдентификацииСтрокиВыбор(Команда.ИспользуемаяТаблица.ТекущиеДанные.Значение, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)

	Если ПроверитьЗаполнение() Тогда
		
		ПараметрыЗакрытия = Новый Структура();
		ПараметрыЗакрытия.Вставить("ТипИдентификацииСтроки", ТипИдентификацииСтроки);
		ПараметрыЗакрытия.Вставить("РеквизитИдентификацииСтроки", РеквизитИдентификацииСтроки);
		ПараметрыЗакрытия.Вставить("РеквизитыИдентификацииСтроки", ВыбранныеРеквизитыИдентификацииСтроки.ВыгрузитьЗначения());
		
		Закрыть(ПараметрыЗакрытия);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФормуПриСоздании(Отказ)
	
	Если МетаданныеТЧ = Неопределено Тогда
		SUI_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось определить метаданные табличной части документа.
		|Выполните настройку табличной части.'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	НаименованиеТабличнойЧасти = МетаданныеТЧ.Синоним;
	
	ТипИдентификацииСтроки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыИдентификацииТЧ, "ТипИдентификацииСтроки");
	РеквизитИдентификацииСтроки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыИдентификацииТЧ, "РеквизитИдентификацииСтроки");
	РеквизитыИдентификацииСтроки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыИдентификацииТЧ, "РеквизитыИдентификацииСтроки", Новый Массив(), Тип("Массив"));
		
	Для Каждого МетаданныеРеквизитаТЧ Из МетаданныеТЧ.Реквизиты Цикл
		
		Элементы.РеквизитИдентификацииСтроки.СписокВыбора.Добавить(МетаданныеРеквизитаТЧ.Имя, МетаданныеРеквизитаТЧ.Синоним);
		
		Если РеквизитыИдентификацииСтроки.Найти(МетаданныеРеквизитаТЧ.Имя) <> Неопределено Тогда
			ВыбранныеРеквизитыИдентификацииСтроки.Добавить(МетаданныеРеквизитаТЧ.Имя, МетаданныеРеквизитаТЧ.Синоним);
		Иначе
			ДоступныеРеквизитыИдентификацииСтрок.Добавить(МетаданныеРеквизитаТЧ.Имя, МетаданныеРеквизитаТЧ.Синоним);
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.РеквизитИдентификацииСтроки.СписокВыбора.СортироватьПоПредставлению();
	ВыбранныеРеквизитыИдентификацииСтроки.СортироватьПоПредставлению();
	ДоступныеРеквизитыИдентификацииСтрок.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтраницуНастройкиРеквизитовИдентификацииСтрок()
	
	Если ТипИдентификацииСтроки = ПредопределенноеЗначение("Перечисление.SUI_ТипыИдентификацииСтрокТЧ.ПоРеквизиту") Тогда
		Элементы.СтраницыНастройкиРеквизитовИдентификации.ТекущаяСтраница = Элементы.СтраницыНастройкиРеквизитовИдентификацииПоРеквизиту;
	ИначеЕсли ТипИдентификацииСтроки = ПредопределенноеЗначение("Перечисление.SUI_ТипыИдентификацииСтрокТЧ.ПоСовокупностиРеквизитов") Тогда
		Элементы.СтраницыНастройкиРеквизитовИдентификации.ТекущаяСтраница = Элементы.СтраницыНастройкиРеквизитовИдентификацииПоСовокупностиРеквизитов;
	Иначе
		Элементы.СтраницыНастройкиРеквизитовИдентификации.ТекущаяСтраница = Элементы.СтраницыНастройкиРеквизитовИдентификацииПустая;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыИдентификацииСтрокиВыбор(Значение, ДобавитьВВыбор = Истина)
	
	ТаблицаИсточник = ?(ДобавитьВВыбор, "ДоступныеРеквизитыИдентификацииСтрок", "ВыбранныеРеквизитыИдентификацииСтроки");
	ТаблицаПриемник = ?(ДобавитьВВыбор, "ВыбранныеРеквизитыИдентификацииСтроки", "ДоступныеРеквизитыИдентификацииСтрок");
	
	НайденноеЗначение = ЭтотОбъект[ТаблицаИсточник].НайтиПоЗначению(Значение);
	Если НайденноеЗначение <> Неопределено Тогда
		
		ЭтотОбъект[ТаблицаПриемник].Добавить(НайденноеЗначение.Значение, НайденноеЗначение.Представление);
		ЭтотОбъект[ТаблицаИсточник].Удалить(НайденноеЗначение);
		
		ВыбранныеРеквизитыИдентификацииСтроки.СортироватьПоПредставлению();
		ДоступныеРеквизитыИдентификацииСтрок.СортироватьПоПредставлению();
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
